ednieuw/ESP32Communications/Old/ESP32Arduino_CommV030a/ESP32Arduino_CommV030.ino
//------------------------------------------------------------------------------              //
// PIN Assigments for ESP32 S3 DevKitC 1
//------------------------------------------------------------------------------  
enum DigitalPinAssignments {      // Digital hardware constants ATMEGA 328 ----
 SERRX        = 44,               // D1 Connects to Bluetooth TX
 SERTX        = 43,               // D0 Connects to Bluetooth RX
 encoderPinB  = 4,                // D2 left (labeled CLK on decoder)no interrupt pin (Use GPIO pin numbering for rotary encoder lib)  
 encoderPinA  = 5,                // D3 right (labeled DT on decoder)on interrupt pin
 clearButton  = 6,                // D4 switch (labeled SW on decoder)
 IRReceiverPin= 6,                // D4 Infrared receiver pin instead of rotary encoder
 LED_PIN      = 48,               // D5 / GPIO 8 Pin to control colour SK6812/WS2812 LEDs
 PCB_LED_D09  = 10,               // D9
 PCB_LED_D10  = 11,               // D10
 secondsPin   = 13,               // D13  GPIO48 (#ifdef LED_BUILTIN  #undef LED_BUILTIN #define LED_BUILTIN 48 #endif)
 };
 
enum AnaloguePinAssignments {     // Analogue hardware constants ----
 EmptyA0      = 10,               // Empty
 EmptyA1      = 11,               // Empty
 PhotoCellPin = 12,               // LDR pin
 OneWirePin   = 13,               // OneWirePin
 SDA_pin      = 8,                // SDA pin
 SCL_pin      = 9,                // SCL pin
 EmptyA6      = 16,               // Empty
 EmptyA7     =  17};              // Empty
                          #endif //defined(ARDUINO_NANO_ESP32)
//------------------------------------------------------------------------------              //
// LED
//------------------------------------------------------------------------------
const uint32_t  NUM_LEDS = 1;                                                                // The no of LEDs when a SK6812 or WS2812 LED-strip is attached to LED_PIN
#define CLEARLEDSTARTUP 9999
                     #ifdef USEEDSOFTLED
EdSoftLED LEDstrip;                                                                          // Use EdSoftLED 
EdSoftLED LED6812strip = EdSoftLED(NUM_LEDS, LED_PIN, SK6812WGRB);
EdSoftLED LED2812strip = EdSoftLED(NUM_LEDS, LED_PIN, WS2812GRB);
bool UsedEDSOFTLED = true;
                      #else
Adafruit_NeoPixel LEDstrip;
Adafruit_NeoPixel LED6812strip = Adafruit_NeoPixel(NUM_LEDS, LED_PIN, NEO_GRBW + NEO_KHZ800); // NEO_RGBW
Adafruit_NeoPixel LED2812strip = Adafruit_NeoPixel(NUM_LEDS, LED_PIN, NEO_GRB  + NEO_KHZ800); // NEO_RGB NEO_GRB
bool UsedEDSOFTLED = false;
                      #endif
// #define MCULEDPIN 9
// Adafruit_NeoPixel MCUled = Adafruit_NeoPixel(1, MCULEDPIN, NEO_GRB + NEO_KHZ800);  //NEO_RGB NEO_GRB

//------------------------------------------------------------------------------              //
const uint32_t black    = 0x000000, darkorange    = 0xFF8C00, red        = 0xFF0000, chartreuse   = 0x7FFF00;
const uint32_t brown    = 0x503000, cyberyellow   = 0xFFD300, orange     = 0xFF8000; 
const uint32_t yellow   = 0xFFFF00, cadmiumyellow = 0xFFF600, dyellow    = 0xFFAA00, chromeyellow = 0xFFA700;
const uint32_t green    = 0x00FF00, brightgreen   = 0x66FF00, apple      = 0x80FF00, grass        = 0x00FF80;  
const uint32_t amaranth = 0xE52B50, edamaranth    = 0xFF0050, amber      = 0xFF7E00;
const uint32_t marine   = 0x0080FF, darkviolet    = 0x800080, pink       = 0xFF0080, purple       = 0xFF00FF; 
const uint32_t blue     = 0x0000FF, cerulean      = 0x007BA7, sky        = 0x00FFFF, capri        = 0x00BFFF;
const uint32_t edviolet = 0X7500BC, frenchviolet  = 0X8806CE, coquelicot = 0xFF3800;
const uint32_t greenblue= 0x00F2A0, hotmagenta    = 0xFF00BF, dodgerblue = 0x0073FF, screamingreen= 0x70FF70;
      uint32_t white    = 0xFFFFFF, lgray         = 0x666666, wgray      = 0xAAAAAA;
      uint32_t gray     = 0x333333, dgray         = 0x222222;  

//--------------------------------------------
// DS3231 CLOCK MODULE
//--------------------------------------------
#define DS3231_I2C_ADDRESS          0x68
#define DS3231_TEMPERATURE_MSB      0x11
#define DS3231_TEMPERATURE_LSB      0x12

RTC_DS3231 RTCklok; 
bool DS3231Installed = false;                                                                 // True if the DS3231 is detected

//------------------------------------------------------------------------------              //
// KY-040 ROTARY
//------------------------------------------------------------------------------                       
Encoder myEnc(encoderPinA, encoderPinB);                                                      // Use digital pin  for encoder    
long     Looptime             = 0;
byte     RotaryPress          = 0;                                                            // Keeps track display choice and how often the rotary is pressed.
bool     ChangeLightIntensity = false;                                                        // Increase or decrease slope light intensity        
uint32_t RotaryPressTimer     = 0;
byte     NoofRotaryPressed    = 0;

//--------------------------------------------                                                //
// One-wire keypad
//--------------------------------------------
bool     ChangeTime           = false;                                                        // Flag to change time within 60 seconds       
uint64_t KeyLooptime          = 0;
String   KeypadString         ="";

//------------------------------------------------------------------------------              //
// KEYPAD 3x1
//          -------- GND
//  R Y G   -------- Pin D8
//          -------- Pin D3
//          -------- Pin D4
// COLPIN is used as dummy pin that must  be LOW when there is input from keypad 
//--------------------------------------------
const byte ROWS   = 3; 
const byte COLS   = 1; 
const byte COLPIN = D12;                                                                      // Column that is always LOW. Mimic with a not used pin
char keys[ROWS][COLS] = {{'R'}, {'Y'}, {'G'}};
byte rowPins[ROWS] = { D8, D3, D4};                                                           // Connect to the row pinouts of the keypad
byte colPins[COLS] = {COLPIN};                                                                // Connect to the column pinouts of the keypad
Keypad keypad = Keypad(makeKeymap(keys), rowPins, colPins, ROWS, COLS );

